Tekla Open API Reference for Tekla Structures 2025
BoltCatalogStandard Properties
The BoltCatalogStandard type exposes the following members.
Properties
Name | Description
LinkedBoltCatalogSize
 The BoltCatalogSize control linked to the BoltCatalogStandard control. Bolt catalog controls always need to be in pairs, meaning in every dialog there has to be a BoltCatalogStandard and a BoltCatalogSize control.
Top
See Also
Reference
BoltCatalogStandard Class
Tekla.Structures.Dialog.UIControls Namespace